### Задание 2.1

Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со
столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и
['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно
содержатся данные:
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и
поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [3]:
import numpy as np
import pandas as pd

In [11]:
authors = pd.DataFrame({'authors_id':[1, 2, 3],
                        'authors_name': ['Тургенев', 'Чехов', 'Островский']},
                        columns = ['authors_id', 'authors_name'])

In [18]:
authors

   authors_id authors_name
0           1     Тургенев
1           2        Чехов
2           3   Островский

In [19]:
book = pd.DataFrame({'authors_id': [1, 1, 1, 2, 2, 3, 3],
                    'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                     'price': [450, 300, 350, 500, 450, 370, 290]})

In [20]:
book

   authors_id            book_title  price
0           1           Отцы и дети    450
1           1                 Рудин    300
2           1     Дворянское гнездо    350
3           2      Толстый и тонкий    500
4           2       Дама с собачкой    450
5           3                 Гроза    370
6           3  Таланты и поклонники    290

### Задание 2.2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [21]:
authors_price = pd.merge(authors, book, on = 'authors_id', how = 'inner')
authors_price

   authors_id authors_name            book_title  price
0           1     Тургенев           Отцы и дети    450
1           1     Тургенев                 Рудин    300
2           1     Тургенев     Дворянское гнездо    350
3           2        Чехов      Толстый и тонкий    500
4           2        Чехов       Дама с собачкой    450
5           3   Островский                 Гроза    370
6           3   Островский  Таланты и поклонники    290

### Задание 2.3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [30]:
top5 = authors_price.sort_values(by='price', ascending=False).head(5)
top5

   authors_id authors_name         book_title  price
3           2        Чехов   Толстый и тонкий    500
0           1     Тургенев        Отцы и дети    450
4           2        Чехов    Дама с собачкой    450
5           3   Островский              Гроза    370
2           1     Тургенев  Дворянское гнездо    350